ЕРПУХАстенд.cbr_Основной/src/Documents/cbr_ОперацияСоглашения/cbr_ОперацияСоглашения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>cbr_ОперацияСоглашения</name>
  <registerRecords>AccumulationRegister.cbr_ОстаткиНоменклатурыПоСоглашению</registerRecords>
  <attributes>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Действие</name>
    <type>
      <types>EnumRef.cbr_ВидыДвиженияСоглашенияСКлиентами</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНоменклатура</name>
    <attributes>
      <name>Номенклатура</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЕРПУХАстенд.cbr_Основной/src/AccumulationRegisters/cbr_ОстаткиНоменклатурыПоСоглашению/cbr_ОстаткиНоменклатурыПоСоглашению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>cbr_ОстаткиНоменклатурыПоСоглашению</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ЕРПУХАстенд.cbr_Основной/src/Documents/cbr_ОперацияСоглашения/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.cbr_ОстаткиНоменклатурыПоСоглашению.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	cbr_ОперацияСоглашенияСписокНоменклатура.Номенклатура КАК Номенклатура,
		|	cbr_ОперацияСоглашенияСписокНоменклатура.Характеристика КАК Характеристика,
		|	cbr_ОперацияСоглашенияСписокНоменклатура.Количество КАК Количество
		|ИЗ
		|	Документ.cbr_ОперацияСоглашения.СписокНоменклатура КАК cbr_ОперацияСоглашенияСписокНоменклатура
		|ГДЕ
		|	cbr_ОперацияСоглашенияСписокНоменклатура.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.cbr_ОстаткиНоменклатурыПоСоглашению.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Соглашение = Соглашение;
		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		Движение.Характеристика = ВыборкаДетальныеЗаписи.Характеристика;
		Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
	КонецЦикла;
	
	Ответ = Ложь;
	
	Если Не (РольДоступна("cbr_ЗаписьЗаказаКлиентаСОтрицательнымиОстатками") или РольДоступна("Администрирование")) Тогда
		Ответ = ПроверитьРегистрНаОтрицание();
	КонецЕсли;
	
	Если Ответ Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПроверитьРегистрНаОтрицание()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОперацияСоглашенияСписокНоменклатура.Номенклатура КАК Номенклатура,
		|	ОперацияСоглашенияСписокНоменклатура.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ВТТЧ
		|ИЗ
		|	Документ.cbr_ОперацияСоглашения.СписокНоменклатура КАК ОперацияСоглашенияСписокНоменклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	cbr_ОстаткиНоменклатурыПоСоглашениюОстатки.Номенклатура.Представление КАК НоменклатураПредставление,
		|	-cbr_ОстаткиНоменклатурыПоСоглашениюОстатки.КоличествоОстаток КАК Превышение,
		|	cbr_ОстаткиНоменклатурыПоСоглашениюОстатки.Характеристика.Представление КАК ХарактеристикаПредставление
		|ИЗ
		|	РегистрНакопления.cbr_ОстаткиНоменклатурыПоСоглашению.Остатки(&МоментВремени, (Номенклатура, Характеристика) В
		|		(ВЫБРАТЬ
		|			ВТТЧ.Номенклатура,
		|			ВТТЧ.Характеристика
		|		ИЗ
		|			ВТТЧ КАК ВТТЧ)
		|	И Соглашение = &Соглашение) КАК cbr_ОстаткиНоменклатурыПоСоглашениюОстатки
		|ГДЕ
		|	cbr_ОстаткиНоменклатурыПоСоглашениюОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Соглашение", Соглашение);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Превышение остатка по номенклатуре ""%1"", характеристике ""%2"" на количество ""%3""'"),
			ВыборкаДетальныеЗаписи.НоменклатураПредставление, ВыборкаДетальныеЗаписи.ХарактеристикаПредставление, ВыборкаДетальныеЗаписи.Превышение);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЦикла;
		
	Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
